import { RankPointTable } from './types';

export const rankPointTable: RankPointTable = {
  玉の間: {
    東風: {
      雀豪1: { 1: 70, 2: 35, 3: -5, 4: -95 },
      雀豪2: { 1: 70, 2: 35, 3: -5, 4: -105 },
      雀豪3: { 1: 70, 2: 35, 3: -5, 4: -115 },
      雀聖1: { 1: 70, 2: 35, 3: -5, 4: -125 },
      雀聖2: { 1: 70, 2: 35, 3: -5, 4: -135 },
      雀聖3: { 1: 70, 2: 35, 3: -5, 4: -145 },
    },
    東南: {
      雀豪1: { 1: 125, 2: 60, 3: -5, 4: -180 },
      雀豪2: { 1: 125, 2: 60, 3: -5, 4: -195 },
      雀豪3: { 1: 125, 2: 60, 3: -5, 4: -210 },
      雀聖1: { 1: 125, 2: 60, 3: -5, 4: -225 },
      雀聖2: { 1: 125, 2: 60, 3: -5, 4: -240 },
      雀聖3: { 1: 125, 2: 60, 3: -5, 4: -255 },
    },
  },

  王座の間: {
    東風: {
      雀聖1: { 1: 75, 2: 35, 3: -5, 4: -125 },
      雀聖2: { 1: 75, 2: 35, 3: -5, 4: -135 },
      雀聖3: { 1: 75, 2: 35, 3: -5, 4: -145 },
    },
    東南: {
      雀聖1: { 1: 135, 2: 65, 3: -5, 4: -225 },
      雀聖2: { 1: 135, 2: 65, 3: -5, 4: -240 },
      雀聖3: { 1: 135, 2: 65, 3: -5, 4: -255 },
    },
  },
};

export const rankConfig = {
  "雀豪1": { initial: 1400, promotion: 2800 },
  "雀豪2": { initial: 1600, promotion: 3200 },
  "雀豪3": { initial: 1800, promotion: 3600 },
  "雀聖1": { initial: 2000, promotion: 4000 },
  "雀聖2": { initial: 3000, promotion: 6000 },
  "雀聖3": { initial: 4500, promotion: 9000 },
} as const;

export const rankOrder = [
  "雀豪1", "雀豪2", "雀豪3",
  "雀聖1", "雀聖2", "雀聖3"
] as const;
